TexasInstruments/c2000ware-core-sdk/device_support/f28p65x/headers/source/f28p65x_globalvariabledefs.c
//###########################################################################
//
// FILE:    f28p65x_globalvariabledefs.c
//
// TITLE:   f28p65x Global Variables and Data Section Pragmas.
//
//###########################################################################
// 
// C2000Ware v26.01.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#include "f28p65x_device.h"     // f28p65x Headerfile Include File

//---------------------------------------------------------------------------
// Define Global Peripheral Variables:
//

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("AccessProtectionRegsFile")
#else
#pragma DATA_SECTION(AccessProtectionRegs,"AccessProtectionRegsFile");
#endif
volatile struct ACCESS_PROTECTION_REGS AccessProtectionRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("AdcaRegsFile")
#else
#pragma DATA_SECTION(AdcaRegs,"AdcaRegsFile");
#endif
volatile struct ADC_REGS AdcaRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("AdcbRegsFile")
#else
#pragma DATA_SECTION(AdcbRegs,"AdcbRegsFile");
#endif
volatile struct ADC_REGS AdcbRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("AdccRegsFile")
#else
#pragma DATA_SECTION(AdccRegs,"AdccRegsFile");
#endif
volatile struct ADC_REGS AdccRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("AdcaResultRegsFile")
#else
#pragma DATA_SECTION(AdcaResultRegs,"AdcaResultRegsFile");
#endif
volatile struct ADC_RESULT_REGS AdcaResultRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("AdcbResultRegsFile")
#else
#pragma DATA_SECTION(AdcbResultRegs,"AdcbResultRegsFile");
#endif
volatile struct ADC_RESULT_REGS AdcbResultRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("AdccResultRegsFile")
#else
#pragma DATA_SECTION(AdccResultRegs,"AdccResultRegsFile");
#endif
volatile struct ADC_RESULT_REGS AdccResultRegs;

#ifdef CPU1
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("AdcSafetyIntEvtAgg1RegsFile")
#else
#pragma DATA_SECTION(AdcSafetyIntEvtAgg1Regs,"AdcSafetyIntEvtAgg1RegsFile");
#endif
volatile struct ADC_SAFECHECK_INTEVT_REGS AdcSafetyIntEvtAgg1Regs;
#endif // ifdef CPU1

#ifdef CPU2
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("AdcSafetyIntEvtAgg2RegsFile")
#else
#pragma DATA_SECTION(AdcSafetyIntEvtAgg2Regs,"AdcSafetyIntEvtAgg2RegsFile");
#endif
volatile struct ADC_SAFECHECK_INTEVT_REGS AdcSafetyIntEvtAgg2Regs;
#endif // ifdef CPU2

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ADCSafetyChk1RegsFile")
#else
#pragma DATA_SECTION(ADCSafetyChk1Regs,"ADCSafetyChk1RegsFile");
#endif
volatile struct ADC_SAFECHECK_REGS ADCSafetyChk1Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ADCSafetyChk2RegsFile")
#else
#pragma DATA_SECTION(ADCSafetyChk2Regs,"ADCSafetyChk2RegsFile");
#endif
volatile struct ADC_SAFECHECK_REGS ADCSafetyChk2Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ADCSafetyChk3RegsFile")
#else
#pragma DATA_SECTION(ADCSafetyChk3Regs,"ADCSafetyChk3RegsFile");
#endif
volatile struct ADC_SAFECHECK_REGS ADCSafetyChk3Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ADCSafetyChk4RegsFile")
#else
#pragma DATA_SECTION(ADCSafetyChk4Regs,"ADCSafetyChk4RegsFile");
#endif
volatile struct ADC_SAFECHECK_REGS ADCSafetyChk4Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ADCSafetyChk5RegsFile")
#else
#pragma DATA_SECTION(ADCSafetyChk5Regs,"ADCSafetyChk5RegsFile");
#endif
volatile struct ADC_SAFECHECK_REGS ADCSafetyChk5Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ADCSafetyChk6RegsFile")
#else
#pragma DATA_SECTION(ADCSafetyChk6Regs,"ADCSafetyChk6RegsFile");
#endif
volatile struct ADC_SAFECHECK_REGS ADCSafetyChk6Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ADCSafetyChk7RegsFile")
#else
#pragma DATA_SECTION(ADCSafetyChk7Regs,"ADCSafetyChk7RegsFile");
#endif
volatile struct ADC_SAFECHECK_REGS ADCSafetyChk7Regs;

