TexasInstruments/c2000ware-core-sdk/device_support/f28p65x/headers/source/f28p65x_globalvariabledefs.c
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("CpuTimer2RegsFile")
#else
#pragma DATA_SECTION(CpuTimer2Regs,"CpuTimer2RegsFile");
#endif
volatile struct CPUTIMER_REGS CpuTimer2Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("DacaRegsFile")
#else
#pragma DATA_SECTION(DacaRegs,"DacaRegsFile");
#endif
volatile struct DAC_REGS DacaRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("DaccRegsFile")
#else
#pragma DATA_SECTION(DaccRegs,"DaccRegsFile");
#endif
volatile struct DAC_REGS DaccRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("Dcc0RegsFile")
#else
#pragma DATA_SECTION(Dcc0Regs,"Dcc0RegsFile");
#endif
volatile struct DCC_REGS Dcc0Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("Dcc1RegsFile")
#else
#pragma DATA_SECTION(Dcc1Regs,"Dcc1RegsFile");
#endif
volatile struct DCC_REGS Dcc1Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("Dcc2RegsFile")
#else
#pragma DATA_SECTION(Dcc2Regs,"Dcc2RegsFile");
#endif
volatile struct DCC_REGS Dcc2Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("DcsmCommonRegsFile")
#else
#pragma DATA_SECTION(DcsmCommonRegs,"DcsmCommonRegsFile");
#endif
volatile struct DCSM_COMMON_REGS DcsmCommonRegs;

#ifdef CPU1
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("DcsmZ1OtpRegsFile")
#else
#pragma DATA_SECTION(DcsmZ1OtpRegs,"DcsmZ1OtpRegsFile");
#endif
volatile struct DCSM_Z1_OTP DcsmZ1OtpRegs;
#endif //ifdef CPU1

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("DcsmZ1RegsFile")
#else
#pragma DATA_SECTION(DcsmZ1Regs,"DcsmZ1RegsFile");
#endif
volatile struct DCSM_Z1_REGS DcsmZ1Regs;

#ifdef CPU1
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("DcsmZ2OtpRegsFile")
#else
#pragma DATA_SECTION(DcsmZ2OtpRegs,"DcsmZ2OtpRegsFile");
#endif
volatile struct DCSM_Z2_OTP DcsmZ2OtpRegs;
#endif //ifdef CPU1

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("DcsmZ2RegsFile")
#else
#pragma DATA_SECTION(DcsmZ2Regs,"DcsmZ2RegsFile");
#endif
volatile struct DCSM_Z2_REGS DcsmZ2Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("DevCfgRegsFile")
#else
#pragma DATA_SECTION(DevCfgRegs,"DevCfgRegsFile");
#endif
volatile struct DEV_CFG_REGS DevCfgRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm17DeRegsFile")
#else
#pragma DATA_SECTION(EPwm17DeRegs,"EPwm17DeRegsFile");
#endif
volatile struct DE_REGS EPwm17DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm18DeRegsFile")
#else
#pragma DATA_SECTION(EPwm18DeRegs,"EPwm18DeRegsFile");
#endif
volatile struct DE_REGS EPwm18DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm1DeRegsFile")
#else
#pragma DATA_SECTION(EPwm1DeRegs,"EPwm1DeRegsFile");
#endif
volatile struct DE_REGS EPwm1DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm2DeRegsFile")
#else
#pragma DATA_SECTION(EPwm2DeRegs,"EPwm2DeRegsFile");
#endif
volatile struct DE_REGS EPwm2DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm3DeRegsFile")
#else
#pragma DATA_SECTION(EPwm3DeRegs,"EPwm3DeRegsFile");
#endif
volatile struct DE_REGS EPwm3DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm4DeRegsFile")
#else
#pragma DATA_SECTION(EPwm4DeRegs,"EPwm4DeRegsFile");
#endif
volatile struct DE_REGS EPwm4DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm5DeRegsFile")
#else
#pragma DATA_SECTION(EPwm5DeRegs,"EPwm5DeRegsFile");
#endif
volatile struct DE_REGS EPwm5DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm6DeRegsFile")
#else
#pragma DATA_SECTION(EPwm6DeRegs,"EPwm6DeRegsFile");
#endif
volatile struct DE_REGS EPwm6DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm7DeRegsFile")
#else
#pragma DATA_SECTION(EPwm7DeRegs,"EPwm7DeRegsFile");
#endif
volatile struct DE_REGS EPwm7DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm8DeRegsFile")
#else
#pragma DATA_SECTION(EPwm8DeRegs,"EPwm8DeRegsFile");
#endif
volatile struct DE_REGS EPwm8DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm9DeRegsFile")
#else
#pragma DATA_SECTION(EPwm9DeRegs,"EPwm9DeRegsFile");
#endif
volatile struct DE_REGS EPwm9DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm10DeRegsFile")
#else
#pragma DATA_SECTION(EPwm10DeRegs,"EPwm10DeRegsFile");
#endif
volatile struct DE_REGS EPwm10DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm11DeRegsFile")
#else
#pragma DATA_SECTION(EPwm11DeRegs,"EPwm11DeRegsFile");
#endif
volatile struct DE_REGS EPwm11DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm12DeRegsFile")
#else
#pragma DATA_SECTION(EPwm12DeRegs,"EPwm12DeRegsFile");
#endif
volatile struct DE_REGS EPwm12DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm13DeRegsFile")
#else
#pragma DATA_SECTION(EPwm13DeRegs,"EPwm13DeRegsFile");
#endif
volatile struct DE_REGS EPwm13DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm14DeRegsFile")
#else
#pragma DATA_SECTION(EPwm14DeRegs,"EPwm14DeRegsFile");
#endif
volatile struct DE_REGS EPwm14DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm15DeRegsFile")
#else
#pragma DATA_SECTION(EPwm15DeRegs,"EPwm15DeRegsFile");
#endif
volatile struct DE_REGS EPwm15DeRegs;

