TexasInstruments/c2000ware-core-sdk/device_support/f28p65x/headers/source/f28p65x_globalvariabledefs.c
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm16DeRegsFile")
#else
#pragma DATA_SECTION(EPwm16DeRegs,"EPwm16DeRegsFile");
#endif
volatile struct DE_REGS EPwm16DeRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("DmaRegsFile")
#else
#pragma DATA_SECTION(DmaRegs,"DmaRegsFile");
#endif
volatile struct DMA_REGS DmaRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap1RegsFile")
#else
#pragma DATA_SECTION(ECap1Regs,"ECap1RegsFile");
#endif
volatile struct ECAP_REGS ECap1Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap2RegsFile")
#else
#pragma DATA_SECTION(ECap2Regs,"ECap2RegsFile");
#endif
volatile struct ECAP_REGS ECap2Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap3RegsFile")
#else
#pragma DATA_SECTION(ECap3Regs,"ECap3RegsFile");
#endif
volatile struct ECAP_REGS ECap3Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap4RegsFile")
#else
#pragma DATA_SECTION(ECap4Regs,"ECap4RegsFile");
#endif
volatile struct ECAP_REGS ECap4Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap5RegsFile")
#else
#pragma DATA_SECTION(ECap5Regs,"ECap5RegsFile");
#endif
volatile struct ECAP_REGS ECap5Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap6RegsFile")
#else
#pragma DATA_SECTION(ECap6Regs,"ECap6RegsFile");
#endif
volatile struct ECAP_REGS ECap6Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap7RegsFile")
#else
#pragma DATA_SECTION(ECap7Regs,"ECap7RegsFile");
#endif
volatile struct ECAP_REGS ECap7Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap1SignalMonitoringRegsFile")
#else
#pragma DATA_SECTION(ECap1SignalMonitoringRegs,"ECap1SignalMonitoringRegsFile");
#endif
volatile struct ECAP_SIGNAL_MONITORING ECap1SignalMonitoringRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap2SignalMonitoringRegsFile")
#else
#pragma DATA_SECTION(ECap2SignalMonitoringRegs,"ECap2SignalMonitoringRegsFile");
#endif
volatile struct ECAP_SIGNAL_MONITORING ECap2SignalMonitoringRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap3SignalMonitoringRegsFile")
#else
#pragma DATA_SECTION(ECap3SignalMonitoringRegs,"ECap3SignalMonitoringRegsFile");
#endif
volatile struct ECAP_SIGNAL_MONITORING ECap3SignalMonitoringRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap4SignalMonitoringRegsFile")
#else
#pragma DATA_SECTION(ECap4SignalMonitoringRegs,"ECap4SignalMonitoringRegsFile");
#endif
volatile struct ECAP_SIGNAL_MONITORING ECap4SignalMonitoringRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap5SignalMonitoringRegsFile")
#else
#pragma DATA_SECTION(ECap5SignalMonitoringRegs,"ECap5SignalMonitoringRegsFile");
#endif
volatile struct ECAP_SIGNAL_MONITORING ECap5SignalMonitoringRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap6SignalMonitoringRegsFile")
#else
#pragma DATA_SECTION(ECap6SignalMonitoringRegs,"ECap6SignalMonitoringRegsFile");
#endif
volatile struct ECAP_SIGNAL_MONITORING ECap6SignalMonitoringRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ECap7SignalMonitoringRegsFile")
#else
#pragma DATA_SECTION(ECap7SignalMonitoringRegs,"ECap7SignalMonitoringRegsFile");
#endif
volatile struct ECAP_SIGNAL_MONITORING ECap7SignalMonitoringRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("Emif1ConfigRegsFile")
#else
#pragma DATA_SECTION(Emif1ConfigRegs,"Emif1ConfigRegsFile");
#endif
volatile struct EMIF1_CONFIG_REGS Emif1ConfigRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EMIF1RegsFile")
#else
#pragma DATA_SECTION(EMIF1Regs,"EMIF1RegsFile");
#endif
volatile struct EMIF_REGS EMIF1Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPGMuxRegsFile")
#else
#pragma DATA_SECTION(EPGMuxRegs,"EPGMuxRegsFile");
#endif
volatile struct EPG_MUX_REGS EPGMuxRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPGRegsFile")
#else
#pragma DATA_SECTION(EPGRegs,"EPGRegsFile");
#endif
volatile struct EPG_REGS EPGRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm17RegsFile")
#else
#pragma DATA_SECTION(EPwm17Regs,"EPwm17RegsFile");
#endif
volatile struct EPWM_REGS EPwm17Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm18RegsFile")
#else
#pragma DATA_SECTION(EPwm18Regs,"EPwm18RegsFile");
#endif
volatile struct EPWM_REGS EPwm18Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm1RegsFile")
#else
#pragma DATA_SECTION(EPwm1Regs,"EPwm1RegsFile");
#endif
volatile struct EPWM_REGS EPwm1Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm2RegsFile")
#else
#pragma DATA_SECTION(EPwm2Regs,"EPwm2RegsFile");
#endif
volatile struct EPWM_REGS EPwm2Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm3RegsFile")
#else
#pragma DATA_SECTION(EPwm3Regs,"EPwm3RegsFile");
#endif
volatile struct EPWM_REGS EPwm3Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm4RegsFile")
#else
#pragma DATA_SECTION(EPwm4Regs,"EPwm4RegsFile");
#endif
volatile struct EPWM_REGS EPwm4Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm5RegsFile")
#else
#pragma DATA_SECTION(EPwm5Regs,"EPwm5RegsFile");
#endif
volatile struct EPWM_REGS EPwm5Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm6RegsFile")
#else
#pragma DATA_SECTION(EPwm6Regs,"EPwm6RegsFile");
#endif
volatile struct EPWM_REGS EPwm6Regs;

