TexasInstruments/c2000ware-core-sdk/device_support/f28p65x/headers/source/f28p65x_globalvariabledefs.c
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm7RegsFile")
#else
#pragma DATA_SECTION(EPwm7Regs,"EPwm7RegsFile");
#endif
volatile struct EPWM_REGS EPwm7Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm8RegsFile")
#else
#pragma DATA_SECTION(EPwm8Regs,"EPwm8RegsFile");
#endif
volatile struct EPWM_REGS EPwm8Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm9RegsFile")
#else
#pragma DATA_SECTION(EPwm9Regs,"EPwm9RegsFile");
#endif
volatile struct EPWM_REGS EPwm9Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm10RegsFile")
#else
#pragma DATA_SECTION(EPwm10Regs,"EPwm10RegsFile");
#endif
volatile struct EPWM_REGS EPwm10Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm11RegsFile")
#else
#pragma DATA_SECTION(EPwm11Regs,"EPwm11RegsFile");
#endif
volatile struct EPWM_REGS EPwm11Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm12RegsFile")
#else
#pragma DATA_SECTION(EPwm12Regs,"EPwm12RegsFile");
#endif
volatile struct EPWM_REGS EPwm12Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm13RegsFile")
#else
#pragma DATA_SECTION(EPwm13Regs,"EPwm13RegsFile");
#endif
volatile struct EPWM_REGS EPwm13Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm14RegsFile")
#else
#pragma DATA_SECTION(EPwm14Regs,"EPwm14RegsFile");
#endif
volatile struct EPWM_REGS EPwm14Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm15RegsFile")
#else
#pragma DATA_SECTION(EPwm15Regs,"EPwm15RegsFile");
#endif
volatile struct EPWM_REGS EPwm15Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm16RegsFile")
#else
#pragma DATA_SECTION(EPwm16Regs,"EPwm16RegsFile");
#endif
volatile struct EPWM_REGS EPwm16Regs;

#ifdef CPU1
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwmXbarBRegsFile")
#else
#pragma DATA_SECTION(EPwmXbarBRegs,"EPwmXbarBRegsFile");
#endif
volatile struct EPWM_XBAR_REGS EPwmXbarBRegs;
#endif // ifdef CPU1

#ifdef CPU1
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwmXbarARegsFile")
#else
#pragma DATA_SECTION(EPwmXbarARegs,"EPwmXbarARegsFile");
#endif
volatile struct EPWM_XBAR_REGS EPwmXbarARegs;
#endif // ifdef CPU1

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm17XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm17XcmpRegs,"EPwm17XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm17XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm18XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm18XcmpRegs,"EPwm18XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm18XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm1XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm1XcmpRegs,"EPwm1XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm1XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm2XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm2XcmpRegs,"EPwm2XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm2XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm3XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm3XcmpRegs,"EPwm3XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm3XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm4XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm4XcmpRegs,"EPwm4XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm4XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm5XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm5XcmpRegs,"EPwm5XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm5XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm6XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm6XcmpRegs,"EPwm6XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm6XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm7XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm7XcmpRegs,"EPwm7XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm7XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm8XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm8XcmpRegs,"EPwm8XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm8XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm9XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm9XcmpRegs,"EPwm9XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm9XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm10XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm10XcmpRegs,"EPwm10XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm10XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm11XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm11XcmpRegs,"EPwm11XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm11XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm12XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm12XcmpRegs,"EPwm12XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm12XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm13XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm13XcmpRegs,"EPwm13XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm13XcmpRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm14XcmpRegsFile")
#else
#pragma DATA_SECTION(EPwm14XcmpRegs,"EPwm14XcmpRegsFile");
#endif
volatile struct EPWM_XCMP_REGS EPwm14XcmpRegs;

