TexasInstruments/c2000ware-core-sdk/device_support/f28p65x/headers/source/f28p65x_globalvariabledefs.c
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("McanbSsRegsFile")
#else
#pragma DATA_SECTION(McanbSsRegs,"McanbSsRegsFile");
#endif
volatile struct MCANSS_REGS McanbSsRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("McanaErrorRegsFile")
#else
#pragma DATA_SECTION(McanaErrorRegs,"McanaErrorRegsFile");
#endif
volatile struct MCAN_ERROR_REGS McanaErrorRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("McanbErrorRegsFile")
#else
#pragma DATA_SECTION(McanbErrorRegs,"McanbErrorRegsFile");
#endif
volatile struct MCAN_ERROR_REGS McanbErrorRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("McanaRegsFile")
#else
#pragma DATA_SECTION(McanaRegs,"McanaRegsFile");
#endif
volatile struct MCAN_REGS McanaRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("McanbRegsFile")
#else
#pragma DATA_SECTION(McanbRegs,"McanbRegsFile");
#endif
volatile struct MCAN_REGS McanbRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("MemoryErrorRegsFile")
#else
#pragma DATA_SECTION(MemoryErrorRegs,"MemoryErrorRegsFile");
#endif
volatile struct MEMORY_ERROR_REGS MemoryErrorRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("MemCfgRegsFile")
#else
#pragma DATA_SECTION(MemCfgRegs,"MemCfgRegsFile");
#endif
volatile struct MEM_CFG_REGS MemCfgRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("NmiIntruptRegsFile")
#else
#pragma DATA_SECTION(NmiIntruptRegs,"NmiIntruptRegsFile");
#endif
volatile struct NMI_INTRUPT_REGS NmiIntruptRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("HRPWMCAL1RegsFile")
#else
#pragma DATA_SECTION(HRPWMCAL1Regs,"HRPWMCAL1RegsFile");
#endif
volatile struct HRPWMCAL_REGS HRPWMCAL1Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("HRPWMCAL2RegsFile")
#else
#pragma DATA_SECTION(HRPWMCAL2Regs,"HRPWMCAL2RegsFile");
#endif
volatile struct HRPWMCAL_REGS HRPWMCAL2Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("HRPWMCAL3RegsFile")
#else
#pragma DATA_SECTION(HRPWMCAL3Regs,"HRPWMCAL3RegsFile");
#endif
volatile struct HRPWMCAL_REGS HRPWMCAL3Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm17MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm17MinDbLutRegs,"EPwm17MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm17MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm18MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm18MinDbLutRegs,"EPwm18MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm18MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm1MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm1MinDbLutRegs,"EPwm1MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm1MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm2MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm2MinDbLutRegs,"EPwm2MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm2MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm3MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm3MinDbLutRegs,"EPwm3MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm3MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm4MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm4MinDbLutRegs,"EPwm4MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm4MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm5MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm5MinDbLutRegs,"EPwm5MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm5MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm6MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm6MinDbLutRegs,"EPwm6MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm6MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm7MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm7MinDbLutRegs,"EPwm7MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm7MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm8MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm8MinDbLutRegs,"EPwm8MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm8MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm9MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm9MinDbLutRegs,"EPwm9MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm9MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm10MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm10MinDbLutRegs,"EPwm10MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm10MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm11MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm11MinDbLutRegs,"EPwm11MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm11MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm12MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm12MinDbLutRegs,"EPwm12MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm12MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm13MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm13MinDbLutRegs,"EPwm13MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm13MinDbLutRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EPwm14MinDbLutRegsFile")
#else
#pragma DATA_SECTION(EPwm14MinDbLutRegs,"EPwm14MinDbLutRegsFile");
#endif
volatile struct MINDB_LUT_REGS EPwm14MinDbLutRegs;

